&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачалоПериода = НачалоГода(ТекущаяДата());
	КонецПериода = КонецГода(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	АдресФайлаВоВременномХранилище = "";
	ВыгрузитьНаСервере(АдресФайлаВоВременномХранилище);
	ПолучитьФайл(АдресФайлаВоВременномХранилище, "Выгрузка.xml");
КонецПроцедуры

&НаСервере
Функция ВыгрузитьНаСервере(АдресФайлаВоВременномХранилище)
	Расширение = ".xml";
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФП_Месячный.Номер КАК Номер,
	|	ФП_Месячный.Дата КАК Дата,
	|	ФП_Месячный.Период КАК Период,
	|	ФП_Месячный.Статьи.(
	|		НомерСтроки КАК НомерСтроки,
	|		Вид.Код КАК ВидКод,
	|		ПланГодовой КАК ПланГодовой,
	|		ПланМесячный КАК ПланМесячный
	|	) КАК Статьи
	|ИЗ
	|	Документ.ФП_Месячный КАК ФП_Месячный
	|ГДЕ
	|	ФП_Месячный.ПометкаУдаления = ЛОЖЬ
	|	И ФП_Месячный.Дата >= &Дата1
	|	И ФП_Месячный.Дата <= &Дата2";
	
	Запрос.УстановитьПараметр("Дата1", НачалоПериода);
	Запрос.УстановитьПараметр("Дата2", КонецПериода);	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	//заполняем файло	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла,"UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Выгрузка");
	Для Каждого СТР Из Выборка Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("НовыйДокумент");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номер");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(СТР.Номер));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Дата");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(СТР.Дата));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Период");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(СТР.Период));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Для Каждого ТЧ Из СТР.Статьи Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоваяСтатья");
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ВидКод");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(ТЧ.ВидКод));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ПланГодовой");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(ТЧ.ПланГодовой));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ПланМесячный");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(ТЧ.ПланМесячный));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	//заполняем файло	
	
	Файл = Новый Файл(ИмяВременногоФайла);	
	Если Файл.Существует() Тогда		
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		УдалитьФайлы(ИмяВременногоФайла);		
	КонецЕсли;	

КонецФункции


&НаКлиенте
Процедура Загрузить(Команда)
	ПриЗавершении = Новый ОписаниеОповещения("ПоместитьФайлКомандаЗавершение", ЭтотОбъект);
	ПередПомещением = Новый ОписаниеОповещения("ПоместитьФайлКомандаПередПомещением", ЭтотОбъект);
	ДиалогВыбораФайлов = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайлов.Заголовок = "Выбор файла для помещения";
	ДиалогВыбораФайлов.МножественныйВыбор = Ложь;
	ДиалогВыбораФайлов.Фильтр = "Файлы выгрузки|*.xml";
	НачатьПомещениеФайла(ПриЗавершении, , ДиалогВыбораФайлов, Истина, , ПередПомещением);
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьФайлКомандаЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Результат Тогда
		ОбработатьНаСервере(Адрес);
		ОповеститьОбИзменении(Тип("ДокументСсылка.ФП_Месячный"));
		Сообщить("Загрузка завершена");
	Иначе
		Сообщить("Всетаки нужно было что-то выбрать");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьФайлКомандаПередПомещением(ПомещаемыйФайл, ОтказОтПомещенияФайла, ДополнительныеПараметры) Экспорт
	Если ПомещаемыйФайл.Размер() > 4*1024*1024 Тогда
		ПоказатьПредупреждение(, "Превышен максимальный размер файла");
		ОтказОтПомещенияФайла = Истина;
	КонецЕсли;
	Файл = ПомещаемыйФайл.Файл.ПолноеИмя;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьНаСервере(Адрес)
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	Парсер = Новый ЧтениеXML;
	Парсер.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(Данные,КодировкаТекста.UTF8));
	Пока Парсер.Прочитать() Цикл
		
		Если (Парсер.Имя = "НовыйДокумент") И (Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			НовыйДокумент = Документы.ФП_Месячный.СоздатьДокумент();
		КонецЕсли;
		
		Если (Парсер.Имя = "НовыйДокумент") И (Парсер.ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Если (Парсер.Имя = "Номер") И (Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			Если Парсер.Прочитать() Тогда
				НовыйДокумент.Номер = Парсер.Значение;
			КонецЕсли;
		КонецЕсли;
		
		Если (Парсер.Имя = "Дата") И (Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			Если Парсер.Прочитать() Тогда
				НовыйДокумент.Дата = XmlЗначение(Тип("Дата"), Парсер.Значение);
			КонецЕсли;
		КонецЕсли;
		
		Если (Парсер.Имя = "Период") И (Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			Если Парсер.Прочитать() Тогда
				НовыйДокумент.Период = ПредопределенноеЗначение("Перечисление.ФП_Месяцы." + Парсер.Значение);
			КонецЕсли;
		КонецЕсли;
		
		Если (Парсер.Имя = "НоваяСтатья") И (Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			НоваяСтрокаДокумента = НовыйДокумент.Статьи.Добавить();
		КонецЕсли;
		
		Если (Парсер.Имя = "ВидКод") И (Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			Если Парсер.Прочитать() Тогда
				НоваяСтрокаДокумента.Вид = Справочники.ФП_СтатьиДвижения.НайтиПоКоду(Парсер.Значение);
			КонецЕсли;
		КонецЕсли;
		
		Если (Парсер.Имя = "ПланГодовой") И (Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			Если Парсер.Прочитать() Тогда
				НоваяСтрокаДокумента.ПланГодовой = Парсер.Значение;
			КонецЕсли;
		КонецЕсли;
		
		Если (Парсер.Имя = "ПланМесячный") И (Парсер.ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			Если Парсер.Прочитать() Тогда
				НоваяСтрокаДокумента.ПланМесячный = Парсер.Значение;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла; 
	Парсер.Закрыть();
	
КонецПроцедуры